[{"episode":"001","title":"The State of Web Development","description":"For our very first episode of the Front End Happy Hour podcast, we have our panelists (Augustus Yuan, Derrick Showers, Jem Young, Ryan Anklam and Ryan Burgess) discuss their opinions on the Medium article posted in early January, titled \"The Sad State of Web Development\", written by Drew Hamlett. The panel shares their thoughts on front end tools and how they view the current state of web development.","published":"February 29, 2016"},{"episode":"002","title":"RxJS - Async and Drink","description":"In the second episode of the Front End Happy Hour podcast, our special guest, Ben Lesh joins us to talk about all the great things in RxJS 5.","published":"March 16, 2016"},{"episode":"003","title":"From head to footer","description":"In this ever changing industry of front end development, developers are constantly learning. In this episode of Front End Happy Hour we discuss everything from our school backgrounds and what lead us to front end development. We also share ways we stay up to date with the ever-changing landscape of new technologies. Along with our usual panelists, we are joined by guest Sarah Showers, a front end developer from Apple.","published":"March 24, 2016"},{"episode":"004","title":"ES6 and a Six Pack","description":"ECMAScript 6 was a major release for the JavaScript language. There’s a lot of great new features that have been added. In this episode we discuss how you can start using ES6 today and what we’ll start seeing in the next year for the latest update to ECMAScript. We share our favorite features and the best ways to learn and stay up to date with new features.","published":"April 04, 2016"},{"episode":"005","title":"Interviews make us drink","description":"In order to work professionally as a front end developer, there is always an intense interview process. In this episode, we share our experiences and thoughts on the interviews we’ve done in the past. Not only have we had experience being interviewed, we’ve also had a lot of experience interviewing other engineers for jobs at our companies. We share things we’re looking for when we interview candidates to join our teams.","published":"April 14, 2016"},{"episode":"006","title":"Unit testing and whiskey tasting","description":"We’ve all heard unit testing is good, but how do you get started writing unit tests? In this episode of Front End Happy Hour we share our experiences and advice writing unit tests. We discuss why it’s important and beneficial to have unit tests in your JavaScript. We share how we’ve approached unit tests and what a good unit test looks like. We also talk about the various tools and frameworks available to get your code properly tested.","published":"April 25, 2015"},{"episode":"007","title":"a11y Cocktail","description":"In this episode, we have a special guest joining us to talk about digital accessibility, Jennison Asuncion who is a leader in the accessibility community and has a lot of information to help us improve our websites and applications be more accessible for all users. We also talk about Global Accessibility Awareness Day (GAAD) coming up on May 19th. Find out how you can participate.","published":"May 15, 2016"},{"episode":"008","title":"A Shot of Silicon Valley","description":"Working in Silicon Valley is very unique. We work in a bubble, immersed in technology. There are billboards about frameworks, technology, and gadgets. Coffee shops are filled with people on Macbooks covered in stickers. Conversations on the train, coffee shops and on the streets are about programming languages. There’s a unique culture from other places we’ve all lived. In this episode, we share our thoughts and experiences living and working in Silicon Valley.","published":"May 24, 2016"},{"episode":"009","title":"Scotch makes us animated","description":"In this episode we learn about animating with JavaScript. We’re joined by a special guest, Sarah Drasner, who is an expert in JavaScript and SVG animations. Having good animations in your product is really important for the overall user experience. In the episode we discuss various libraries to help create animations in your websites or applications. Sarah shares a lot of valuable information.","published":"June 6, 2016"},{"episode":"010","title":"Raise your glass to women in tech","description":"In the technology industry we’re continually trying to grow the diversity of people who are working in the space. Most recently there have been a lot of great efforts made to increase the number of women in tech. In this episode we are joined by two talented women working at large tech companies in the Bay Area, Lisa Burgess (Uber) and Mars Jullian (Netflix). We discuss what it’s like to be a women working in tech and talk about ways we can help foster a more inclusive industry.","published":"July 12, 2016"},{"episode":"011","title":"Transpilers - slow down and drink","description":"Leveraging transpilers is extremely helpful in allowing us to extend the JavaScript language in ways JavaScript engines cannot. There are a lot of amazing transpilers available in the JavaScript community and we all love transpilers, but there are things developers should be aware of when we’re using transpilers.","published":"July 27, 2016"},{"episode":"012","title":"Ninja Rockstar Whiskey Drinker With 10 Years IPA Experience","description":"As an engineer or developer we currently fortunate enough to have a wide selection of amazing jobs and companies to work for. Although we have a wide selection of jobs, finding the right one is extremely important and may require some additional work. In this episode, we are joined by the guests Chrissy Running and Alayna Ketner who are both talented recruiters at Netflix. Chrissy and Alayna have a lot of experience working with engineers to help find the ideal role. We’ll discuss types of things companies are looking for and how you can best leverage competitive offers in your job searches.","published":"August 8, 2016"},{"episode":"013","title":"Drinking in the present to learn future JavaScript","description":"In episode 13 of the Front End Happy Hour podcast, we’re joined by Jafar Husain from Netflix to talk with us about the future of JavaScript. Jafar is part of the TC-39 committee that helps determine the future specs of ECMAScript. Jafar shares a lot of interesting insights into how the committee works and how a feature makes it's way into the spec. Jafar also talks to us about Observables and cancellable promises.","published":"August 17, 2016"},{"episode":"014","title":"Hangovers and hotels: engineer conferences","description":"Conferences continue to be a great way to learn and grow as an engineer. In the 14th episode of the Front End Happy Hour podcast we discuss the value of conferences and why you might want to attend. It’s a special episode because we recorded at React Rally in Salt Lake City. At the conference we caught up with a lot of great attendees and speakers to hear about their experiences at conferences and the benefits for attending.","published":"August 28, 2016"},{"episode":"015","title":"A flight of JavaScript frameworks","description":"In the JavaScript community, we have a lot of amazing frameworks that help us in our day to day work. It can be at times overwhelming to understand what framework is the best one to use. In this episode, we discuss our thoughts and opinions on the various frameworks.","published":"September 12, 2016"},{"episode":"016","title":"Spilled beer and epic fails","description":"As an engineer we build things, but we also make mistakes or introduce bugs into the software we write. In this episode, we share horror stories of things that we’ve experienced in our careers and how we’ve learned from them. Hopefully, this episode helps you avoid making similar mistakes.","published":"September 25, 2016"},{"episode":"017","title":"Managing our drinks","description":"In this episode, we are joined by Chris Saint-Amant from Netflix to help discuss what it’s like to transition from being an engineer to becoming an engineering manager. We share our thoughts on what engineers expect in their manager and share advice for engineers interested in moving into a management role.","published":"October 13, 2016"},{"episode":"018","title":"Shotgunning websites: web performance","description":"Users are extremely sensitive to web performance. The slightest change in a website’s load time can impact a user staying or going. In this episode we talk about ways to help improve web performance and why it’s so important.","published":"October 29, 2016"},{"episode":"019","title":"Drinking to digital nomads","description":"The idea of working remotely has become more realistic over the past few years, making it easier for engineers to do their work without being tied to a physical location. In this episode, we are joined by Darren Buckner, Founder and CEO of Workfrom, and Sarah Showers from LinkedIn. Both guests will join us to discuss the pros and cons of working from your favorite coffee shop.","published":"November 7, 2016"},{"episode":"020","title":"Wasted on workflows","description":"We are lost without our tools. In this episode, we share the tools and applications we can’t live without. We discuss what development environments we use and plugins we find useful.","published":"November 20, 2016"},{"episode":"021","title":"Mixed drinks and Mixed languages","description":"Have you had to deal with supporting more than one language in your web application? Offering content in several languages makes a better experience for your users but it can add many layers of complexity in your application’s design and architecture. In this episode we’ll be discussing the ways we have dealt with supporting multiple languages.","published":"December 5, 2016"},{"episode":"022","title":"Drinking with more style and less sass","description":"Writing CSS seems pretty straight forward until your project and team starts to grow. CSS has a lot of issues, in this episode we share some advice for making it a little bit easier. We’ll also discuss ways to create a scalable CSS architecture for large projects and teams.","published":"December 16, 2016"},{"episode":"023","title":"Ember - Gin & Tomster","description":"Ember is a growing JavaScript framework that large companies like LinkedIn are using for their web application. In this episode, we are joined by Stacy London from Atlassian to discuss the advantages and disadvantages of leveraging Ember as a JavaScript framework.","published":"December 30, 2016"},{"episode":"024","title":"The hangover of 2016","description":"As we look forward to all the great trends and changes that will happen in 2017, in this episode we discuss our thoughts and opinions on the various development trends and notable things that happened in 2016. Looking forward on 2017, we share some of the things we’re excited to see in the new year.","published":"January 15, 2017"},{"episode":"025","title":"From bar-back to frontender","description":"We’ve all started out somewhere in our career. In previous episodes, we’ve talked about various ways we’ve learned front end development, but haven’t touched on mentorship. In this episode, Sarah Showers joins us in the conversation about starting out as a junior developer and how mentors helped shape us into senior developers.","published":"January 24, 2017"},{"episode":"026","title":"Design, neat","description":"In this episode, we’re joined by Julie Horvath, a Design Lead at Apple to help us talk about design. We discuss ways to help improve the collaboration between designers and frontend developers. Julie shares her perspective on building great user experiences for low-bandwidth internet speeds and how taking a progressive enhancement approach can be beneficial to the user.","published":"February 7, 2017"},{"episode":"027","title":"A drink for the \"Rust\" of us","description":"Rust is an exciting systems programming language that’s being developed in Mozilla. In this episode, we’re joined by Jafar Husain to talk about the Rust and what the benefits of leveraging a language like Rust. We also talk about why a JavaScript engineer would want to learn Rust and how it can help them in their JavaScript coding.","published":"February 15, 2017"},{"episode":"028","title":"JavaScript Universi-LongIslandIce-ty","description":"We’ve all started somewhere. JavaScript isn’t always an easy language to learn. In this episode, we’re joined by Gordon Zhu, who teaches workshops on JavaScript at Watch and Code. We are also joined by Luis Vargas, a Senior Manager on Global Payments at Netflix who has recently been learning JavaScript and has attended one of Gordon’s workshops. In this episode, we all talk about our journey of learning JavaScript and ways we’ve worked through it.","published":"February 26, 2017"},{"episode":"029","title":"Alcoholic Angular","description":"In this episode, we’re joined by our special guest, Ayşegül Yönet, a Software Engineer Autodesk, who will help us discuss the popular Google JavaScript framework Angular. In the episode, we discuss the benefits of leveraging Angular and what the major differences are from Angular 1 and Angular 2.","published":"March 12, 2017"},{"episode":"030","title":"Static site generators and dynamic drink drinkers","description":"Websites have gotten a lot more complicated over the years. What happened to static HTML? In this episode we’re joined by Harry Wolff, the creator of Reptar, to talk about leveraging build tools to create static generated sites. We talk about the pros and cons of leveraging a static site generator for a website. We also discuss some of the tools available to help you get started.","published":"March 24, 2017"},{"episode":"031","title":"A flaming shot of burnout","description":"Burnout is not a rare phenomenon that engineers deal with. In this episode, we talk about the ways we’ve been affected by burnout and how we’ve dealt with it. We discuss past experiences that have created burnout for us and ways we can prevent it from happening in the future.","published":"April 9, 2017"},{"episode":"032","title":"Imposter Syndrome - These are not the drinks you're looking for","description":"What’s it like to deal with Imposter Syndrome? In this episode, we are joined by Jessica Grist, a Software Engineer at Adroll to discuss how we’ve all experience Imposter Syndrome in our careers and share ways to help deal with it.","published":"April 23, 2017"},{"episode":"033","title":"One part beer, three parts web components. Add lemon to taste","description":"In this episode, we are joined by Trey Shugart who is a front-end developer (Principal Developer) at Atlassian, proponent of web components, and author of SkateJS to talk about Web Components.","published":"May 7, 2017"},{"episode":"034","title":"npm install beer --save-in-mouth","description":"In this episode, we are joined by Laurie Voss, the COO and former CTO at npm. Npm, also known as Node Package Manager has been an important tool in the JavaScript community and has helped engineers share their code. In today’s episode, we’ll be discussing how we leverage npm and find out what we can expect from npm 5. Laurie also teaches us some cool tricks that exist in the npm cli.","published":"May 22, 2017"},{"episode":"035","title":"Top shelf style guides","description":"In this episode, we’re joined by Jyri Tuulos and Josh London to help discuss reusable components and building style guides. Jyri is a Staff Engineer at AdRoll and Josh is a Senior Designer at Netflix. We discuss best practices companies are leveraging style guides and reusable components. We also share the positives and negatives to having a style guide.","published":"June 4, 2017"},{"episode":"036","title":"First drink at a new bar","description":"Starting a new job is never easy, but a good onboarding process can make all the difference. In this episode, we talk about our experiences with onboarding at companies we’ve worked at and share our thoughts on what makes a good experience when starting a new job.","published":"June 18, 2017"},{"episode":"037","title":"Amazing Manhattans Anywhere","description":"We’ve received a lot of great questions from our listeners and wanted to take the time to answer them as an AMA (Ask Me Anything) episode. Thank you all for the great questions, we had a lot of fun answering them.","published":"July 5, 2017"},{"episode":"038","title":"Plotting our drinks","description":"In this episode, we’re joined by Shirley Wu, a Freelance Software Engineer who focuses on Data Visualization. Shirley shares a lot of knowledge about Data Visualization using JavaScript.","published":"July 17, 2017"},{"episode":"039","title":"Smashed after a Swift shot","description":"In this episode, we’re joined by Stefan Stumpfl, a mobile software engineer at LinkedIn working on LinkedIn Learning. During the past 5 years as an iOS developer, he has experience ranging from building his own app on a small 2-person team to larger teams like his current role at LinkedIn. In this episode, we will discuss the Swift programming language – how it compares to languages like Javascript and some of the advantages and disadvantages to writing and learning it.","published":"July 30, 2017"},{"episode":"040","title":"React Native - Mix Once, Drink Everywhere","description":"In this episode, we’re joined by Naoufal Kadhom, a Software Engineer from Netflix who’s also just released a payment library for React Native. In the episode, we’ll be discussing React Native and what it’s like to leverage it for Android and iOS applications.","published":"August 14, 2017"},{"episode":"041","title":"Maintaining a healthy buzz","description":"Maintaining and scaling code is an important aspect of our careers. In this episode, we discuss and share ideas to help keep a healthy code base that will scale with your company.","published":"August 27, 2017"},{"episode":"042","title":"Work hard, drink hard","description":"There’s always a lot to be done, but having a good work life balance is extremely important. In this episode, we are joined by Sarah Showers from LinkedIn, to talk with us about work life balance. We share our thoughts on what work life balance means to us and how our companies help foster a healthy work life balance.","published":"September 13, 2017"},{"episode":"043","title":"Our first drink","description":"We all had to start somewhere. In this episode, we are joined by Preethi Kasireddy to talk with us about her and our experiences of being a beginner to coding.","published":"October 1, 2017"},{"episode":"044","title":"Champagne ideas and caviar dreams","description":"Writing great code isn’t always the only part of our jobs. In order to impact changes on our teams or the business, we need to be able to persuade others to buy into your ideas. This could be in the form of migrating to a new technology, process or even adding a new feature to a product. In this episode, we are joined by Shirley Wu to help us discuss how we can best sell our ideas and make an impact on our teams or clients.","published":"October 15, 2017"},{"episode":"045","title":"Getting the bartender's attention","description":"In a previous episode, we discussed working with a recruiter during a job interview process. In this episode, we’re joined by Netflix recruiter, Bianca Bortolussi to discuss ways to help your engineering profile stand out to recruiters and hiring managers.","published":"October 29, 2017"},{"episode":"046","title":"Locking down the liquor","description":"In this episode of the Front End Happy Hour podcast, we discuss how as front end engineers we can impact security vulnerabilities in the applications and websites we are creating.","published":"November 14, 2017"},{"episode":"047","title":"Speak(easy)","description":"Often times in our careers we’ve wanted to speak at conferences, meetups or even within our companies. It’s been a great way to share ideas and things we’ve learned. Giving a tech talk isn’t always the easiest thing. In this episode, we’ll be discussing what we’ve learned from our experiences and share advice on ways to help improve your next talk.","published":"November 26, 2017"},{"episode":"048","title":"Toast to a new year","description":"It’s been a great year! With 2017 coming to an end, we’ve decided to talk the highlights, trends, and disappointments of the year. We also talk about what we’re excited about in 2018.","published":"December 18, 2017"},{"episode":"049","title":"Independent taste testing","description":"We are back in 2018, for the first episode of the New Year we have two special guests, Shirley Wu and Amy Wibowo to talk with us about freelancing and running your own business. We discuss how to start freelance work, how to manage clients and how to handle difficult clients.","published":"January 21, 2018"},{"episode":"050","title":"Angling for a drink","description":"For our 50th episode, we are on stage live at the 2018 ngATL conference. We are joined by four of the talented speakers, Aimee Knight, Simona Cotin, John Papa, and April Wensel to talk about the state of Angular.","published":"February 5, 2018"},{"episode":"051","title":"Gin and toxic culture","description":"In this episode, we’ll be discussing things we’ve noticed in companies that have unhealthy culture, shady business practices, moving business targets and more. We talk about ways to avoid an unhealthy culture and how to help improve one.","published":"February 18, 2018"},{"episode":"052","title":"Looking Forward to a drink","description":"In this episode, we recorded live on stage at Forward JS conference in San Francisco. We were joined by our special guest, Allen Wirfs-Brock to talk about how the web has changed over the years and how JavaScript has been a large influence.","published":"March 4, 2018"},{"episode":"053","title":"Bar-tending to your codebase","description":"In this episode, we recorded live at SacJS event in Sacramento, California. On stage, we discuss the challenges of migrating a codebase and when to make the decision its the right time to refactor. We share lessons we’ve learned from past experiences.","published":"March 18, 2018"},{"episode":"054","title":"Wasted on Elm","description":"In this episode, we are joined by Richard Feldman to talk about the functional language Elm, which compiles to JavaScript. In the episode, we learn about the benefits to leveraging Elm and how to get started.","published":"April 1, 2018"},{"episode":"055","title":"A mixologist's tools","description":"In this episode, we discuss how we stay productive in our jobs. To help us with the discussion, we’re joined by Ellen Chisa, CEO, and Cofounder of Dark. We talk about tools and strategies we’ve found useful to help stay productive.","published":"April 16, 2018"},{"episode":"056","title":"Drink-a-thon onstage at Reactathon","description":"In this episode, we were live on stage at Reactathon conference in San Francisco discussing how to scale a React application. We share our thoughts on to best approaches to creating a good structure for your codebase at scale. We also share our experiences we’ve learned over the years how to scale our React applications.","published":"April 29, 2018"},{"episode":"057","title":"Falcor - Modeling our drinks","description":"In this episode, we’re joined by the Netflix Software Engineer, Anup Bishnoi to talk with us about the Netflix, open source, virtual JSON graph library, Falcor.","published":"April 13, 2018"},{"episode":"058","title":"User testing - Even a drunk person can do it","description":"A lot of the work we do impacts the people using the product or application we’ve made and it’s important to understand how our users resonate with the products we create. A great way to better understand what works for a user is by doing user testing. In this episode, we’ll be discussing user testing.","published":"May 28, 2018"},{"episode":"059","title":"A/B testing - Ale or Bourbon?","description":"In our previous episode, we talked about user testing and to better understand how a product or application resonates with users. In this episode, we’re joined by Lisa Burgess to help talk with us about another great way to get user feedback, A/B testing.","published":"June 10, 2018"},{"episode":"060","title":"Shots to growlers - finding the right size drink","description":"In this episode, we are joined by Shirley Wu and Brian Holt to talk with us about the various experiences we’ve had with startups, large companies, agencies, and freelance work.","published":"June 24, 2018"},{"episode":"061","title":"Build tooling - brewing complex bundles","description":"The front end ecosystem of build tooling continues to grow and become more powerful over the years. In this episode, we’re joined by Jamie Kyle and Maia Teegarden to talk with us about the power of build tools.","published":"July 8, 2018"},{"episode":"062","title":"Web Components - Shots of shadow dom","description":"In this episode, we talk with Ravi Srinivas and Erick Purino from Netflix to share how they are leveraging Web Components to create dynamic advertisements across the web.","published":"July 22, 2018"},{"episode":"063","title":"IoT - Internet of Tequila","description":"In this episode, we share our thoughts on IoT and smart devices in the home. We also talk about how JavaScript can be used to create your own smart devices. To talk with us about the smart devices, we’re joined by our guest, Sarah Showers from LinkedIn.","published":"August 5, 2018"},{"episode":"064","title":"Librations - JavaScript libraries","description":"In this episode, we’ll be discussing JavaScript libraries. We talk about when to use a library and when it might not be that practical.","published":"August 19, 2018"},{"episode":"065","title":"Recruiting - do you have time for a quick beer?","description":"We’ve had a lot of great recruiting discussions on previous episodes. In this episode, we’re joined by 3 recruiters, Matt Stephenson, Zack Skelly, and Chris Ahsing from 3 different startups to talk with us about how to stand out as an engineer, and what questions to ask recruiters about opportunities.","published":"September 2, 2018"},{"episode":"066","title":"Type systems - a static drink list","description":"Static type systems in JavaScript provide a lot of value and have been growing in popularity. In this episode, we’re joined by Lauren Tan and Kunal Bohra to talk with us about the benefits of leveraging a type system in your codebase.","published":"September 16, 2018"},{"episode":"067","title":"Ethics - to drink or not to drink?","description":"In this episode, we recorded a special live discussion on ethics in software development. The panel discussion was part of Certified Fresh Events with host Brian Rinaldi.","published":"September 30, 2018"},{"episode":"068","title":"Progressive Web Apps - Pale Wheat Ale","description":"Progressive Web Apps have been hailed as the next big leap forward in building web applications. In this episode we’re joined by Aaron Gustafson from Microsoft to talk all about PWA’s and the future of the web.","published":"October 14, 2018"},{"episode":"069","title":"Internships - Intern-sips","description":"Starting your career is a daunting task. You’ve learned these brand new skills, but how do you apply them and get experience? In this episode, we are joined by Moira Huang, to help us talk about internships and how best leverage an internship into a full time job.","published":"October 28, 2018"},{"episode":"070","title":"Senior Engineer - Master Brewer","description":"We are often asked, what makes you a Senior Software Engineer. It’s not an easy answer, there are a lot of interesting thoughts and responses. In this episode, we are joined by Lauren Tan to help discuss our thoughts on what makes someone be a Senior Software Engineer over a Software Engineer.","published":"November 25, 2018"},{"episode":"071","title":"Web Performance - Chugging our drinks down fast","description":"Creating performant websites and applications continue to be more and more important. In this episode, we are joined by Addy Osmani to talk with us about web performance and some future web platform APIs that help improve performance.","published":"December 9, 2018"},{"episode":"072","title":"Pacing our drinks - Engineering Performance","description":"Creating performant websites and applications continues to be really important, but what about engineering performance? How do we make sure we are improving our productivity as engineers? In this episode, we are joined Jacques Favreau and Michael Paulson from Netflix to hear more about their thoughts on being more productive.","published":"January 6, 2019"},{"episode":"073","title":"Drinks to go - Native mobile solutions","description":"There are a lot of great solutions available to support a native mobile experience for your application, but what’s the best option? In this episode we are joined by Jordanna Kwok from Netflix, to talk with us about some of the solutions and how to think through the best solution.","published":"January 20, 2019"},{"episode":"074","title":"Beer money - negotiating salaries","description":"We’ve talked about interviewing for engineering jobs, but once you have an offer, how do you negotiate the salary? In this episode, we’re joined by Matthew Gerstman, an engineer from Dropbox to talk with us about salaries, and stock.","published":"February 3, 2019"},{"episode":"075","title":"Component libraries - sharing our drinks","description":"In this episode, we are joined by Jeeyun Linn, and Cole Turner to talk with us about building and using component libraries in a company.","published":"February 18, 2019"},{"episode":"076","title":"Bandersnatching our drinks","description":"Bandersnatch is an exciting Netflix interactive film that’s not only an amazing story, it has seamless experience that Netflix engineering teams have created. In this episode, we are joined by engineering managers, Maria Kazandjieva, Maxine Cheung, and Courtney Kennedy to talk about the work their teams have done to make Bandersnatch possible.","published":"March 3, 2019"},{"episode":"077","title":"Career growth - beers and careers","description":"In past episodes, we’ve shared our thoughts on helping others grow or how to help interns in your company, but we haven’t discussed our thoughts on our own career growth. In this episode, we’ll share our thoughts and opinions on career growth.","published":"March 31, 2019"},{"episode":"078","title":"Our drinking is overrated","description":"In this episode, Jem and Ryan each toss out frontend terms, languages, technologies, and patterns to debate if they are underrated or overrated.","published":"April 14, 2019"},{"episode":"079","title":"Home-brewing front end culture","description":"In this episode, we are joined by Katie Sylor-Miller, a Staff Software Engineer from Etsy, to talk with us about ways to help build and foster a frontend culture within your companies.","published":"April 28, 2019"},{"episode":"080","title":"User experience - what if users are drunk?","description":"In this episode, we are joined by Randall Koutnik, a Senior Software Engineer at Slack to talk with us about how we should be thinking about ways to build better user experiences.","published":"May 14, 2019"},{"episode":"081","title":"CSS - continually sipping sazeracs","description":"In this episode, we are joined by Tyler Childs, a Senior Software Engineer at Netflix to talk with us about building out scalable CSS and share some of the exciting new features in the latest version of CSS.","published":"May 26, 2019"},{"episode":"082","title":"Product management - Pouring Martinis","description":"In this episode, we’re joined by product managers, Michael Spiegelman, Cathy Conk, and Eddy Wu from Netflix to talk with us about the relationship between engineers and product managers.","published":"June 9, 2019"},{"episode":"083","title":"Behind the bar - Collaborating with the Backend","description":"In this episode, we are joined by Ujjwal Tyagi and Eric Eiswerth to talk with us about how Backend and Frontend engineers can be most effective collaborating.","published":"June 23, 2019"},{"episode":"084","title":"Niagara Falls, on the rocks - development process","description":"There are quite a few ways to organize a team to build out a new feature. Two of the most talked-about are Waterfall and Agile. In this episode, we’ll be talking through the pros and cons of some of the development processes we’ve encountered.","published":"July 21, 2019"},{"episode":"085","title":"The art of mixology - creative coding","description":"In this episode, we are joined by a returning guest, Shirley Wu to talk with us about the combination of code and art.","published":"August 4, 2019"},{"episode":"086","title":"A new brand of bourbon - code migrations","description":"We’ve all faced some form of code migration in the past and wanted to share some of the things we’ve learned. In this episode, we’re joined by Micah Ransdell, a Software Engineering Manager at Netflix to talk with us about migrating a codebase.","published":"August 18, 2019"},{"episode":"087","title":"Open bar - all things open source","description":"As engineers we have a lot of excellent tools and resources to help us do our jobs well, one of those resources is open source code. In this episode, we will be talking about all things open source.","published":"September 15, 2019"},{"episode":"088","title":"Tech lead engineer - herding cats & drinks","description":"We often talk a lot about growth paths as engineers. One of those growth paths could be a tech lead engineer. In this episode, we are joined by Tony Edwards to help talk with us about what the role and responsibilities of a lead engineer are.","published":"September 29, 2019"},{"episode":"089","title":"Hollywood Martinis - Netflix Studio Engineering","description":"In this episode, we are going to be talking with Priyankaa Vijayakumar and Lauren Tan about an interesting engineering effort their teams at Netflix are working on. Netflix continues to create its own content and Hollywood is an interesting world with a ton of opportunities for engineering to integrate technology to make things more efficient. Priyankaa and Lauren will be telling us more about those engineering challenges.","published":"October 27, 2019"},{"episode":"090","title":"Sipping our drinks, enjoying the Vue - Vue JS","description":"In this episode, we are joined by Sarah Drasner and Gift Egwuenu to talk with us about the popular JavaScript framework, VueJS.","published":"November 24, 2019"},{"episode":"091","title":"Balancing your drinks & belonging - Inclusion & Diversity in Tech","description":"It is really important to make sure our community is an inclusive environment for everyone to feel like they belong. In this episode, we are joined by Cher and Henry Zhu to talk with us about inclusion and diversity.","published":"December 8, 2019"},{"episode":"092","title":"Keeping the taps on - Holiday code freeze","description":"Happy Holidays! In this episode, we talk about supporting large applications over the holidays and what the best practices are in order to make sure your customers have 100% availability over the holidays.","published":"December 22, 2019"},{"episode":"093","title":"Beers and Careers - Career Management","description":"It can be really important to think about what you want in your career. In this episode, we are joined by Michael Gaskill to talk with us about career management.","published":"January 5, 2020"},{"episode":"094","title":"Will code for wine - Civic hacking","description":"It’s always great to be able to put our skills to good use. In this episode, we are joined by Sarah Yu to talk with us about civic hacking.","published":"January 20, 2020"},{"episode":"095","title":"Shot for Shot - One on Ones","description":"As engineers, we spend a lot of our time coding, but we also spend a lot of time in meetings. A typical meeting we are in is one on one meetings. In this episode, we talk about ways to get the most out of one on one meetings and avoid having bad ones.","published":"February 16, 2020"},{"episode":"096","title":"Our preferred beverages - Work preferences","description":"There’s a constant debate on what the preferred work environment is, in office, remote, or work from home. In this episode, we talk about our preferences and some of the pros and cons of each work option.","published":"March 1, 2020"},{"episode":"097","title":"Cocktail recipes - Design systems","description":"In this episode, we recorded live on stage at Root Insurance in Columbus, Ohio. We were joined by Jibran Kutik and Oliver Farshi to talk with about design systems and how engineers and designers collaborate.","published":"March 15, 2020"},{"episode":"098","title":"Drinking alone? Together? - Working from home","description":"With the COVID-19 situation, we are all confined to our homes. In this episode, we thought it’d be an excellent opportunity to talk through our experiences working from home during this time.","published":"March 20, 2020"},{"episode":"099","title":"No REST with Quintessential Libations - GraphQL","description":"In this episode, we are joined by Shruti Kapoor to talk with us about GraphQL and why your company could benefit from leveraging GraphQL on the front end and the back end.","published":"March 29, 2020"},{"episode":"100","title":"100 beers on the wall","description":"This is our 100th episode, it’s an exciting milestone for the podcast. In this episode, we talk about the history of the podcast and talk about some of our favorite moments and episodes.","published":"April 12, 2020"},{"episode":"101","title":"Showing off our personal bars - Personal projects","description":"We all focus a lot of our time on engineering work for large companies, but we’ve each had our side projects we’ve worked on in our careers. In this episode, we share our side projects we’ve done in the past.","published":"April 26, 2020"},{"episode":"102","title":"Complex flavors - complex systems","description":"We’ve all been there, a project starts off simple, but quickly becomes more complex. In this episode, we are joined by Sarah Drasner to talk with us about how to deal with complex codebases and systems.","published":"May 10, 2020"},{"episode":"103","title":"Brews in Bars - Ecosystem Engineering","description":"In this episode, we learn more about Ecosystem Engineering from Netflix engineers, Michael James, and Shravan Heroor.","published":"May 24, 2020"},{"episode":"104","title":"#BlackLivesMatter","description":"Instead of listening to an episode of Front End Happy Hour this week, we want to encourage you to use the hour to check out educational materials about the long history of structural racism and injustice Black people continue to face as well as learn how you can be actively anti-racist to affect real change. In our show notes, we’ve provided a list of picks that includes podcasts, videos, books, and articles available for you to learn more. The list of resources will be in the show notes. Simply put, Black lives matter.","published":"June 5, 2020"},{"episode":"105","title":"A parcel of drinks - Parcel","description":"In previous episodes, we’ve talked a lot about bundling JavaScript, but we haven’t talked a lot about Parcel. In this episode, we are joined by Maia Teegarden, Will Binns-Smith, and Devon Govett to talk with us about Parcel JS.","published":"June 14, 2020"},{"episode":"106","title":"Carefully Sipping Sangria - CSS","description":"Writing CSS is quick to learn, but writing strong CSS patterns that can scale is a lot more challenging. In this episode, we are joined by Brad Frost to discuss useful patterns in CSS and the future of CSS.","published":"June 28, 2020"},{"episode":"107","title":"Public speakeasy - Public speaking","description":"Whether you’re giving a presentation to a large audience at a conference, your team, or articulating an idea, public speaking is an important skill set. In this episode, we are joined by Anne Ricketts to talk with us to share ways to be a strong presenter.","published":"July 12, 2020"},{"episode":"108","title":"Whiteboarding for our drinks - The coding interview","description":"We’ve all been there, coding interviews always have their challenges. In this episode, we are joined by Emma Bostian to talk with us about the technical coding interview. We share our experiences and thoughts on what we like and dislike about the various coding interviews.","published":"July 26, 2020"},{"episode":"109","title":"Quick pour - Web Performance","description":"Web performance continues to be an input factor to prioritize when building web applications. In this episode, we speak with Google engineers, Kristofer Baxtor, and Jason Miller about the latest best practices in web performance.","published":"August 09, 2020"},{"episode":"110","title":"Bartending to everyone - Inclusive language","description":"Alongside the Black Lives Matter movement, we’ve started to see a lot of positive discussions on how the tech community can be more inclusive with its language. In this episode, we will be discussing our thoughts on making tech language more inclusive.","published":"August 23, 2020"},{"episode":"111","title":"Patron, Palomas, and programmatic problem solving","description":"When we are writing code as engineers, no matter what programming language, we are doing some form of planning and problem solving. In this episode, we are talking about programmatic problem solving with Nicole Archambault.","published":"September 6, 2020"},{"episode":"112","title":"SEO - Searching for our drinks","description":"Build it and they will come, right? Wrong. Search Engine Optimization is a key component of how people will discover your website or application. In this episode, we are joined by Netflix engineer, Cole Turner to talk with us about the importance of SEO and ways to improve your ranking in search engines.","published":"September 20, 2020"},{"episode":"113","title":"Severless - serving(less) drinks","description":"Do you remember the days of FTP? In this episode, we are joined by Jerome Hardaway to talk with us about the changes made to hosting websites and how serverless has improved the ways we serve up websites and applications.","published":"October 4, 2020"},{"episode":"114","title":"Remote interviewing - drinking on video calls","description":"When you can’t interview in person, we are forced to interview over video calls. In this episode, we are joined by Bianca Bortolussi, and Jen Pi to talk with us about what it’s like to interview for a new role during these covid times.","published":"October 18, 2020"},{"episode":"115","title":"Imposter Syndrome - Wine connoisseur with a $15 bottle","description":"What’s it like to deal with Imposter Syndrome? In this episode, we are joined by Shirley Wu, to talk through each of our experiences dealing with imposter syndrome and have we’ve overcome it.","published":"November 4, 2020"},{"episode":"116","title":"Live at QCon Plus 2020","description":"In this episode, we were joined by our guests, Ben Ilegbodu and Jason Lengstorf to discuss frontend patterns live at this year's QCon Plus conference. On the panel, we shared our thoughts on various frontend trends and patterns being used. We also took questions from the live QCon Plus audience.","published":"November 15, 2020"},{"episode":"117","title":"Quitting a job - leaving the bar","description":"We’ve all decided at one point or another that it’s time to look for a new job. In this episode, we talk through reasons that lead to us looking for new opportunities in our past jobs.","published":"November 29, 2020"},{"episode":"118","title":"Good manager, bad manager - tasty drink, bland drink","description":"In our last episode, we talked about leaving a job, and one of those reasons for leaving was due to a bad manager. In this episode, we follow up our discussion on what makes a good manager.","published":"December 20, 2020"},{"episode":"119","title":"2020 reflections - Fireball shots","description":"In this episode, we will be reflecting on the past year and how things have drastically changed for how we work and how our companies have had to adapt during a pandemic.","published":"December 31, 2020"},{"episode":"120","title":"Building side projects - Served with a tasty Sidecar","description":"In this episode, we are joined by Evan Payne to talk with us about how we each approach side projects. Evan also shares a side project he’s built in Angular.","published":"Jan 17, 2020"},{"episode":"121","title":"Transitioning to a new role - Bar hopping","description":"At some point or another, we’ve all had to move to a new role or a new company. In this episode, we are joined by special guests Tara Ellis and Jared Jordan to help us discuss things we’ve learned to help transition to a new role or job.","published":"January 31, 2021"},{"episode":"122","title":"Productivity Engineering - Ballmer Peak","description":"How do developer teams stay productive? In this episode, we are talking with Kathryn Koehler and Andy Glover from the Netflix Productivity Engineering team to learn more about what a Productivity Engineering team does to help improve productivity.","published":"February 14, 2021"},{"episode":"123","title":"Documentation - the bartenders' almanac","description":"How important is documentation? In this episode, we share our thoughts and opinions on how we approach documentation and the tools that have helped us. ","published":"February 28, 2021"},{"episode":"124","title":"Software estimating - two finger pour","description":"When it comes to estimating the time it takes to build any software project, it’s never easy. There’s a lot of factors that go into estimating. In this episode, we talk about our experiences with estimating and ways we’ve improved it over the years.","published":"March 14, 2021"},{"episode":"125","title":"Non-traditional backgrounds - Old Fashioneds with a twist","description":"Not everyone starts their engineering career with a Computer Science degree, there are a lot of ways to start an engineering career. In this episode, we are joined by David Simmer from Netflix to talk with us about non-traditional backgrounds.","published":"March 28, 2021"},{"episode":"126","title":"Core Web Vitals - Vital libations","description":"Optimizing websites for a quality user experience is key to the long-term success of any site on the web and Core Web Vitals is an initiative Google has provided as a unified guidance for quality signals that are essential to delivering a great user experience on the web. Addy Osmani and Kristofer Baxter, from Google, join us to talk more about Core Web Vitals.","published":"April 11, 2021"},{"episode":"127","title":"Writing a technical book - drafts on tap","description":"Our very own Shirley Wu and her friend, Nadieh Bremer recently wrote a book called, Data Sketches so we wanted to learn more about what it’s like to write a technical book. In this episode, we are joined by Nadieh to talk with us about the process of writing and having a book published. ","published":"April 25, 2021"},{"episode":"128","title":"Branding & self-promotion - mimosa and self-promosa","description":"As you build your career, it’s helpful to think about your personal brand and how you promote yourself in the industry. In this episode, we are joined by Alice Lee, to talk with us about how each of us approach branding and self-promotion.","published":"May 9, 2021"},{"episode":"129","title":"Allyship - Inviting everyone to the party","description":"A big way to help make a more inclusive tech industry, we need strong allies. In this episode, we are joined by Better Allies, Karen Catlin, to talk with us about allyship.","published":"May 23, 2021"},{"episode":"130","title":"Stack and infrastructure shaping culture - Drink choice to set the vibe","description":"In previous episodes we've talked about how to choose a technical stack and figure out what works best for you and your team. In this episode, we are joined by Jason Lengstorf to talk about how the choice of stack and infrastructure reflects the company culture.","published":"June 6, 2021"}]